# # 导入模块
# from bilibili_api import video
#
# # 参数
# BVID = "BV1g5411a7vC"
#
# # 获取视频信息
# info = video.get_video_info(bvid=BVID)
#
# # 假设这里获取 p1 的最新弹幕信息，需要取出 page_id，即每 p 都有自己的编号
# page_id = info["pages"][0]["cid"]
#
# # 然后开始获取弹幕
# danmakus = video.get_danmaku(bvid=BVID, page_id=page_id)
#
# # 打印出来！
# for dm in danmakus:
#     print(str(dm))
# with open('stopwords_cn.txt') as f:
#     f.readlines().strip()


import re

#Bpart='{‘番剧’:[‘连载动画’, ‘新番时间表’, ‘完结动画’, ‘番剧索引’, ‘资讯’, ‘官方延伸’]‘国创’:[‘国产动画’, ‘资讯’, ‘国产原创相关’, ‘新番时间表’, ‘布袋戏’, ‘国产动画索引’, ‘动态漫·广播剧’]‘动画’:[‘MAD·AMV’,  ‘特摄’,  ‘MMD·3D’, ‘动漫杂谈’,  ‘短片·手书·配音’,  ‘综合’,  ‘手办·模玩’]‘游戏’:[‘单机游戏’, ‘桌游棋魂’, ‘游戏赛事’, ‘电子竞技’, ‘GMV’, ‘手机游戏’, ‘音游’, ‘网络游戏’, ‘Mugen’]‘鬼畜’:[‘鬼畜调教’, ‘教程演示’, ‘音MAD’, ‘人力VOCALOID’, ‘鬼畜剧场’]‘音乐’:[‘原创音乐’, ‘音乐现场’, ‘音乐综合’, ‘翻唱’,  ‘MV’, ‘说唱’, ‘演奏’, ‘乐评盘点’, ‘VOCALOID UTAU’, ‘音乐教学’]‘舞蹈’:[‘宅舞’, ‘手势·网红舞’, ‘街舞’, ‘舞蹈综合’, ‘明星舞蹈’, ‘舞蹈教程’, ‘国风舞蹈’]‘影视’:[‘影视杂谈’, ‘影视剪辑’, ‘小剧场’, ‘预告·资讯’]‘娱乐’:[‘综艺’, ‘娱乐杂谈’, ‘粉丝创作’, ‘明星综合’]‘知识’:[‘科普学习’, ‘校园学习’, ‘社科·法律·心理’, ‘职业职场’, ‘人文历史’, ‘设计·创意’, ‘财经商业’,‘野生技能社会’]‘科技’:[‘数码’,  ‘极客DIY’,  ‘软件应用’,  ‘计算机技术’,  ‘科工机械’]‘资讯’:[‘热点’,  ‘环球’,  ‘社会’,  ‘综合’]‘美食’:[‘美食制作’,  ‘美食记录’,  ‘美食侦探’,  ‘美食评测’,  ‘田园美食’]更多：‘生活’:[‘搞笑’,’亲子’,  ‘出行’,  ‘三农’,  ‘家居房产’,  ‘手工’,  ‘绘画’,  ‘日常’]‘动物圈’:[‘喵星人’,  ‘汪星人’,  ‘小宠异宠’,  ‘野生动物’,  ‘动物二创’,  ‘动物综合’]‘虚拟up主’:[‘游戏’,  ‘音乐’,  ‘动画’, ‘其他’]‘汽车’:[‘赛车’,  ‘改装玩车’,  ‘新能源车’,  ‘房车’, ‘摩托车’, ‘购车攻略’, ‘汽车生活’]‘时尚’:[‘美妆护肤’,  ‘仿妆cos’,  ‘穿搭’,  ‘时尚潮流’]‘公开课’:[‘学科课程’, ‘硬核技能’,  ‘考试考证’]‘运动’:[‘篮球’,  ‘足球’,  ‘健身’,  ‘竞技体育’,  ‘运动文化’,  ‘运动综合’]}'
data={'黑龙江': 16, '北京': 142, '上海': 326, '福建': 29, '广西': 21, '辽宁': 33, '山东': 54, '广东': 192, '江苏': 85, '浙江': 122, '河北': 32, '河南': 17, '美国': 15, '韩国': 7, '陕西': 20, '四川': 61, '湖南': 40, '湖北': 23, '云南': 15, '重庆': 27, '天津': 29, '卡塔尔': 2, '山西': 4, '海南': 10, '内蒙古': 11, '贵州': 11, '吉林': 15, '安徽': 18, '西班牙': 2, '意大利': 1, '加拿大': 5, '甘肃': 3, '新西兰': 1, '江西': 9, '德国': 1, '日本': 10, '新疆': 11, '""': 4, '中国香港': 3, '未知': 2, '新加坡': 1, '法国': 3, '英国': 3, '西藏': 1, '芬兰': 2, '几内亚': 1, '澳大利亚': 1, '中国台湾': 3, '宁夏': 1}

data = {key+"省": value for key, value in data.items()}
print(data)
# Bpart = re.sub(r'[‘’]', "'", Bpart) # 将‘和’替换为'
# Bpart = re.sub(r'\](?!\s*\])', '],', Bpart) # 在]后添加,，但排除最后一个]

#print(Bpart)

